[
  {
    "id": "campustoday",
    "name": "CAMPUSTODAY (Platform E-Learning)",
    "last_update": "Feb 2024",
    "type": "E-Learning Platform",
    "stack": ["laravel", "react"],
    "difficulty": 9,
    "description": "Campustoday is a web-based e-learning platform designed to support preparation for the CPNS and UTBK exams. The platform offers a comprehensive range of features, including practice exams (tryouts), ranking systems, and specialized study materials for both CPNS and UTBK. Users can register via email and log in to continue their learning sessions. Additionally, Campustoday provides expert consultation services for more in-depth learning support. The platform also includes a payment system to access premium services.",
    "url": "https://campustoday.net"
  },
  {
    "id": "kofee",
    "name": "KOFEE (Machine Learning)",
    "last_update": "31 Oct 2024",
    "type": "Web Application",
    "stack": ["django", "tensorflow", "cnn"],
    "difficulty": 8,
    "description": "The Kofee project is my final diploma project at Universitas Gajah Mada, titled \"Coffee Leaf Disease Detection System Using the ResNet50V2 Algorithm.\" This web-based application includes features such as user login and registration, a dashboard for diagnosing coffee leaf diseases, viewing diagnosis history, and accessing detailed treatment recommendations for coffee disease management. The machine learning model, developed using Convolutional Neural Networks (CNN) with ResNet50V2 and InceptionV3 architectures, achieved 92.73% accuracy in training, 84.72% in validation, and 86.96% in testing, along with a precision of 0.88, recall of 0.87, and F1-score of 0.87.",
    "url": "projects/kofee/"
  },
  {
    "id": "alhijaz",
    "name": "ALHIJAZ (Platform Haji)",
    "last_update": "10 Jan 2022",
    "type": "CMS (Content Management System)",
    "stack": ["laravel"],
    "difficulty": 6,
    "description": "Haji AlHijaz is an all-inclusive online platform that simplifies the entire Hajj journey for Muslims worldwide. It offers a user-friendly interface where pilgrims can access essential information, book travel arrangements, secure necessary permits, and receive personalized guidance from a dedicated team of experts. With innovative features like virtual reality tours and interactive maps, Haji AlHijaz enhances the spiritual experience by providing a deeper connection to the holy sites of Makkah and Madinah. This comprehensive platform seamlessly integrates technology and tradition, empowering pilgrims to embark on their Hajj pilgrimage with confidence, convenience, and a profound sense of fulfillment.",
    "url": "projects/alhijaz/"
  },
  {
    "id": "teramina",
    "name": "TERAMINA (Shrimp Feed Calculator)",
    "last_update": "12 Apr 2023",
    "type": "Web Application",
    "stack": ["vuejs"],
    "difficulty": 7,
    "description": "Teramina is a web-based application designed to assist shrimp farmers in calculating the optimal feed composition for their shrimp farming operations. The application provides a user-friendly interface where farmers can input various parameters related to their shrimp farming conditions, such as water quality, shrimp species, and growth stage. Based on these inputs, Teramina generates precise recommendations for the ideal feed formulation, ensuring that farmers can maximize their shrimp yield while minimizing feed costs.",
    "url": "projects/teramina/"
  },
  {
    "id": "k3rs",
    "name": "K3RS (Hospital Health and Safety System)",
    "last_update": "04 Nov 2021",
    "type": "Web Application",
    "stack": ["laravel"],
    "difficulty": 8,
    "description": "K3RS is a web-based application designed to assist hospitals in managing health and safety protocols. The application provides a comprehensive platform for hospitals to monitor and ensure compliance with health and safety regulations, track incidents, and implement preventive measures. With features such as incident reporting, risk assessment, and training management, K3RS empowers healthcare facilities to enhance patient safety and maintain a secure environment for both patients and staff.",
    "url": "projects/k3rs/"
  },
  {
    "id": "smaitlh",
    "name": "SMAITLH (Company Profile - High School)",
    "last_update": "Dec 2021",
    "type": "Web Application",
    "stack": ["laravel"],
    "difficulty": 6,
    "description": "SMAITLH is a web-based application designed to serve as a company profile for a high school. The application provides essential information about the school's history, vision, mission, and academic programs. It also includes features such as student registration, course management, and event scheduling. With its user-friendly interface and comprehensive functionality, SMAITLH aims to enhance communication between the school and its stakeholders while promoting transparency and accessibility.",
    "url": "#"
  },
  {
    "id": "ppdbsmaitlh",
    "name": "PPDB SMAITLH (New School Student Acceptance System)",
    "last_update": "Dec 2021",
    "type": "Web Application",
    "stack": ["laravel"],
    "difficulty": 7,
    "description": "PPDB SMAITLH is a web-based application designed to facilitate the new student acceptance process for SMAITLH. The application streamlines the entire admission process, allowing prospective students to register online, submit required documents, and track their application status. With features such as automated notifications and real-time updates, PPDB SMAITLH enhances the efficiency of the admission process while providing a user-friendly experience for both applicants and school administrators.",
    "url": "#"
  },
  {
    "id": "postify",
    "name": "POSTIFY (Social Media Articles)",
    "last_update": "10 Dec 2020",
    "type": "CMS (Content Management System)",
    "stack": ["laravel"],
    "difficulty": 3,
    "description": "Postify is a web-based application designed to help users manage and schedule their social media posts. The application allows users to create, edit, and publish articles across various social media platforms from a single interface. With features such as content calendar, analytics tracking, and collaboration tools, Postify empowers users to optimize their social media presence and engage with their audience effectively.",
    "url": "#"
  },
  {
    "id": "rpkps",
    "name": "RPKPS (Semester Learning Program and Activity Plan)",
    "last_update": "24 June 2022",
    "type": "Web Application",
    "stack": ["laravel"],
    "difficulty": 7,
    "description": "RPKPS is a web-based application designed to assist universities in managing their semester learning program and activity plans. The application provides a comprehensive platform for faculty members to create, review, and approve course syllabi and activity plans. With features such as document management, collaboration tools, and reporting capabilities, RPKPS streamlines the planning process while ensuring compliance with academic standards.",
    "url": "/projects/rpkps"
  },
  {
    "id": "onegapos",
    "name": "ONEGAPOS (Cashier Management System)",
    "last_update": "12 Aug 2022",
    "type": "POS (Point of Sales)",
    "stack": ["laravel", "vuejs"],
    "difficulty": 6,
    "description": "Onegapos is a web-based cashier management system designed to streamline the sales and inventory management processes for businesses. The application provides features such as point-of-sale transactions, inventory tracking, sales reporting, and customer management. With its user-friendly interface and robust functionality, Onegapos empowers businesses to enhance their operational efficiency and improve customer service.",
    "url": "projects/onegapos/"
  },
  {
    "id": "iaicp",
    "name": "IAICP (School Alumni Database)",
    "last_update": "Dec 2020",
    "type": "Web Application",
    "stack": ["php"],
    "difficulty": 5,
    "description": "IAICP is a web-based application designed to manage and maintain a database of school alumni. The application allows schools to track alumni information, including contact details, academic achievements, and career progress. With features such as search functionality, event management, and communication tools, IAICP fosters engagement between the school and its alumni community.",
    "url": "#"
  },
  {
    "id": "dekornata",
    "name": "DEKORNATA (Web E-Commerce)",
    "last_update": "Juni 2022",
    "type": "E-Commerce",
    "stack": ["nodejs", "vuejs"],
    "difficulty": 9,
    "description": "Dekornata is a web-based e-commerce platform designed to facilitate online shopping for customers. The application provides features such as product catalog, shopping cart, order management, and payment processing. With its responsive design and user-friendly interface, Dekornata enhances the online shopping experience while empowering businesses to reach a wider audience.",
    "url": "https://www.dekornata.com"
  },
  {
    "id": "sigmahartek",
    "name": "SIGMA HARTEK (Landing Page Spare Part)",
    "last_update": "14 Jan 2022",
    "type": "Company Profile",
    "stack": ["bootstrap", "javascript"],
    "difficulty": 4,
    "description": "The <b>Sigma Hartek</b> project is a company profile landing page website for PT Sigma Hartek, specializing in spare parts services. Established in 2014, PT Sigma Hartek offers a variety of professional services, including <b>Preproduction Services</b> (Piping Installation and Automation, IQ/OQ Start-Up, Resources Supply, and Commissioning), <b>Production Services</b> (Maintenance, Spare Parts, Reconditioning, Calibration and Verification), <b>Improvement Services</b> (Homogenizer and Lab Unit Upgrades, Pipe Installation Upgrades, Chemical Cleaning, and Passivating), and <b>Training Services</b> (Operator & Maintenance Training, and Plant Consulting). With a focus on pharmaceuticals, cosmetics, and food and beverage industries across Jabodetabek and other regions, PT Sigma Hartek prioritizes customer satisfaction by providing high-quality, cost-effective repair and maintenance solutions in collaboration with reliable spare parts suppliers. The website serves solely to display information about the company and its offerings, without interactive dashboards or additional complex features.",
    "url": "projects/sigma/index.html"
  },
  {
    "id": "karuniamas",
    "name": "KARUNIAMAS (Landing Page Forklift)",
    "last_update": "6 Dec 2021",
    "type": "Company Profile",
    "stack": ["bootstrap", "javascript"],
    "difficulty": 4,
    "description": "",
    "url": "projects/forklift/index.html"
  },
  {
    "id": "buanaliving",
    "name": "BUANA LIVING (Landing Page Homestay)",
    "last_update": "8 Feb 2022",
    "type": "Company Profile",
    "stack": ["bootstrap", "javascript"],
    "difficulty": 4,
    "description": "",
    "url": "projects/buana/index.html"
  },
  {
    "id": "kelapaindonesia",
    "name": "KELEPA INDONESIA (Landing Page)",
    "last_update": "15 Dec 2021",
    "type": "Company Profile",
    "stack": ["bootstrap", "javascript"],
    "difficulty": 4,
    "description": "",
    "url": "projects/kelapa/index.html"
  },
  {
    "id": "expice",
    "name": "EXPICE (Landing Page Restaurant)",
    "last_update": "21 Oct 2021",
    "type": "Company Profile",
    "stack": ["bootstrap", "javascript"],
    "difficulty": 3,
    "description": "",
    "url": "projects/restaurant/index.html"
  },
  {
    "id": "livelihood",
    "name": "LIVELIHOOD (Landing Page Online Store)",
    "last_update": "27 Nov 2021",
    "type": "Company Profile",
    "stack": ["bootstrap", "jaavscript"],
    "difficulty": 3,
    "description": "",
    "url": "projects/livelihood/index.html"
  },
  {
    "id": "erigo",
    "name": "ERIGO (Landing Page Online Store)",
    "last_update": "29 Juli 2021",
    "type": "Company Profile",
    "stack": ["bootstrap", "javascript"],
    "difficulty": 3,
    "description": "",
    "url": "projects/erigo/index.html"
  },
  {
    "id": "worldtime",
    "name": "WORLD TIME (Mobile Application)",
    "last_update": "11 Jan 2022",
    "type": "Mobile Application",
    "stack": ["flutter"],
    "difficulty": 5,
    "description": "",
    "url": "#"
  },
  {
    "id": "kos",
    "name": "KOS (Mobile Application)",
    "last_update": "17 Jun 2022",
    "type": "Mobile Application",
    "stack": ["flutter"],
    "difficulty": 4,
    "description": "",
    "url": "#"
  },
  {
    "id": "miniproject",
    "name": "MINI PROJECTS (CLI Application)",
    "last_update": "31 May 2021",
    "type": "CLI Application",
    "stack": ["python"],
    "difficulty": 3,
    "description": "",
    "url": "#"
  }
]